Breaking the Ice
----------------
Io> "Hiho, Io!" print
Hiho, Io!==> Hiho, Io!

Io> Vehicle := Object clone
==>  Vehicle_0x313640:
  type             = "Vehicle"

Io> Vehicle description := "Something to take you places"
==> Something to take you places

Io> Vehicle description = "Something to take you far away"
==> Something to take you far away

Io> Vehicle nonexistingSlot = "This won't work"

  Exception: Slot nonexistingSlot not found. Must define slot using := operator before updating.
  ---------
  message 'updateSlot' in 'Command Line' on line 1

Io> Vehicle description
==> Something to take you far away

Io> Vehicle slotNames
==> list(type, description)

Io> Vehicle type
==> Vehicle

Io> Object type
==> Object

Objects, prototypes and inheritance
-----------------------------------
Io> Car := Vehicle clone
==>  Car_0x31a4b0:
  type             = "Car"

Io> Car slotNames
==> list(type)
Io> Car type
==> Car
Io> Car description
==> Something to take you far away

Io> ferrari := Car clone
==>  Car_0x24b930:

Io> ferrari slotNames
==> list()
Io> ferrari type
==> Car
Io> Ferrari := Car clone
==>  Ferrari_0x38c870:
  type             = "Ferrari"

Io> Ferrari type
==> Ferrari
Io> Ferrari slotNames
==> list(type)
Io> ferrari slotNames
==> list()
