Basic Facts
-----------
| ?- ['friends.pl'].
compiling ~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day01/friends.pl for byte code...
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day01/friends.pl compiled, 5 lines read - 1085 bytes written, 7 ms

(1 ms) yes
| ?- likes(wallace, sheep).

no
| ?- likes(grommit, cheese).

yes


Basic Inferences and Variables
------------------------------
| ?- friend(wallace, wallace).

no
| ?- friend(grommit, wallace).

yes
| ?- friend(wallace, grommit).

yes
| ?- friend(wendolene, grommit).

no


Filling in the Blanks
---------------------
| ?- ['food.pl'].
compiling ~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day01/food.pl for byte code...
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day01/food.pl compiled, 12 lines read - 1654 bytes written, 6 ms

(1 ms) yes
| ?- food_type(What, meat).

What = spam ? ;

What = sausage ? ;

no
| ?- food_flavor(sausage, sweet).

no
| ?- flavor(sweet, What).

What = dessert ? ;

What = soda

(1 ms) yes
| ?- food_flavor(What, savory).

What = velveeta ? ;

What = spam ? ;

What = sausage ? ;

no

Map Coloring
------------
| ?- ['map.pl'].
compiling ~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day01/map.pl for byte code...
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day01/map.pl compiled, 12 lines read - 1852 bytes written, 13 ms

(2 ms) yes
| ?- coloring(Alabama, Mississippi, Georgia, Tennessee, Florida).

Alabama = blue
Florida = green
Georgia = red
Mississippi = red
Tennessee = green ?

yes

