Sudoku 4
--------
step 1
------
| ?- ['day03/sudoku4.pl'].
compiling ~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/sudoku4.pl for byte code...
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/sudoku4.pl compiled, 0 lines read - 397 bytes written, 11 ms

(1 ms) yes
| ?- sudoku([4,1,2,3,
2,3,4,1,
1,2,3,4,
3,4,1,2], Solution).

Solution = [4,1,2,3,2,3,4,1,1,2,3,4,3,4,1,2]

yes

problems
--------
| ?- sudoku([1,2,3],Solution).

Solution = [1,2,3]

yes
| ?- sudoku([1,2,3,4,5,6,7,8,9,0,1,2,3,4,5,6],Solution).

Solution = [1,2,3,4,5,6,7,8,9,0,1,2,3,4,5,6]

yes

step 2
------
| ?- ['day03/sudoku4.pl'].
compiling ~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/sudoku4.pl for byte code...
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/sudoku4.pl:1-7: warning: singleton variables [S11,S12,S13,S14,S21,S22,S23,S24,S31,S32,S33,S34,S41,S42,S43,S44] for sudoku/2
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/sudoku4.pl compiled, 6 lines read - 1179 bytes written, 7 ms

(1 ms) yes
| ?- sudoku([1,2,3],Solution).

no
| ?- sudoku([1,2,3,4,5,6,7,8,9,0,1,2,3,4,5,6],Solution).

no

final version
-------------
| ?- ['day03/sudoku4.pl'].
compiling ~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/sudoku4.pl for byte code...
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/sudoku4.pl compiled, 30 lines read - 4880 bytes written, 8 ms

(2 ms) yes
| ?- sudoku([_,_,2,3,
_,_,_,_,
_,_,_,_,
3,4,_,_],
Solution).

Solution = [4,1,2,3,2,3,4,1,1,2,3,4,3,4,1,2]

yes

Eight Queens
------------
| ?- ['day03/queens.pl'].
compiling ~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/queens.pl for byte code...
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/queens.pl compiled, 37 lines read - 4495 bytes written, 16 ms

(2 ms) yes
| ?- eight_queens([(1,A),(2,B),(3,C),(4,D),(5,E),(6,F),(7,G),(8,H)]).

A = 1
B = 5
C = 8
D = 6
E = 3
F = 7
G = 2
H = 4 ?

(8150 ms) yes

Eight Queens optimized
----------------------
| ?- ['day03/optimized_queens.pl'].
compiling ~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/optimized_queens.pl for byte code...
~/Documents/Development/Projects/LearningProject/SevenLanguages/03-prolog/day03/optimized_queens.pl compiled, 30 lines read - 4808 bytes written, 9 ms

(2 ms) yes
| ?- eight_queens([(1,A),(2,B),(3,C),(4,D),(5,E),(6,F),(7,G),(8,H)]).

A = 1
B = 5
C = 8
D = 6
E = 3
F = 7
G = 2
H = 4 ?

(6186 ms) yes
